        IDENTIFICATION DIVISION.
        PROGRAM-ID. PANGRAM.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
         01 WS-SENTENCE           PIC X(60) VALUE SPACE.
         01 WS-RESULT             PIC 9 VALUE 0.
         01 WS-CHAR PIC 99.
         01 WS-COUNT PIC 99.
        PROCEDURE DIVISION.
        PANGRAM.
         MOVE 1 TO WS-RESULT.
         MOVE FUNCTION UPPER-CASE(WS-SENTENCE) TO WS-SENTENCE
      *//LOOKING FOR EACH LETTER OF ALPHABET OR RESULT EQUAL 0, NO PANGRAM
         PERFORM VARYING WS-CHAR FROM 1 BY 1 
          UNTIL WS-CHAR EQUAL 26 OR WS-RESULT EQUAL 0
           MOVE 0 TO WS-COUNT
      *// COUNT CHAR -- ASCII MAYUS
            INSPECT WS-SENTENCE TALLYING WS-COUNT 
      *// CHAR(66 + 1/2/3) --> A/B/C... COUNT HOW MANY OF EACH
              FOR ALL FUNCTION CHAR(66 + WS-CHAR)
      *// IF THERE IS NONE OF THAT CHAR, NO PANGRAM
            IF WS-COUNT EQUAL 0 THEN
              MOVE 0 TO WS-RESULT
            END-IF
         END-PERFORM
        .