        IDENTIFICATION DIVISION.
        PROGRAM-ID. ISOGRAM.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WS-PHRASE PIC X(60).
        01 WS-RESULT PIC 99.
        01 WS-CHAR   PIC 99.
        01 WS-COUNT  PIC 99.
        PROCEDURE DIVISION.
        ISOGRAM.
         MOVE 1 TO WS-RESULT.
         MOVE FUNCTION UPPER-CASE(WS-PHRASE) TO WS-PHRASE
      *//LOOKING FOR EACH LETTER OF ALPHABET OR RESULT EQUAL 0, NO ISOGRAM
         PERFORM VARYING WS-CHAR FROM 1 BY 1 
          UNTIL WS-CHAR EQUAL 27 OR WS-RESULT EQUAL 0
           MOVE 0 TO WS-COUNT
      *// COUNT CHAR -- ASCII MAYUS
            INSPECT WS-PHRASE TALLYING WS-COUNT 
      *// CHAR(66 + 1/2/3) --> A/B/C... COUNT HOW MANY OF EACH
              FOR ALL FUNCTION CHAR(65 + WS-CHAR)
      *// IF THERE IS MORE THAN 1, IT IS NOT ISOGRAM
            IF WS-COUNT GREATER THAN 1 THEN
              MOVE 0 TO WS-RESULT
            END-IF
         END-PERFORM
         .
