       IDENTIFICATION DIVISION.
       PROGRAM-ID. rotational-cipher.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-KEY        PIC 9(2).
       01 WS-TEXT       PIC X(128).
       01 WS-LENGTH     PIC 9(3).
       01 WS-CIPHER     PIC X(128).
       01 WS-CHAR       PIC X(1).
       01 WS-CHAR-NUM   PIC 9(3).
       01 WS-CHAR-NUM-ENCRYPTED PIC 9(3).
       01 WS-IND        PIC 9(3).
       PROCEDURE DIVISION.
       ROTATIONAL-CIPHER.
         MOVE FUNCTION LENGTH(WS-TEXT) TO WS-LENGTH
         MOVE FUNCTION UPPER-CASE(WS-TEXT) TO WS-TEXT
      *// LOOKING FOR EACH LETTER OF THE SENTENCE
         PERFORM VARYING WS-IND FROM 1 BY 1 
          UNTIL WS-IND GREATER THAN WS-LENGTH
           MOVE WS-TEXT(WS-IND:1) TO WS-CHAR
      *// CHANGE CHAR TO NUMBER - ASCII
           MOVE FUNCTION ORD(WS-CHAR) TO WS-CHAR-NUM
      *// CALCULATE CHAR WITH KEY
           COMPUTE WS-CHAR-NUM-ENCRYPTED = WS-CHAR-NUM + WS-KEY
      *// IF OUT OF RANGE, SUBTRACT 26
           IF WS-CHAR-NUM-ENCRYPTED > 91
            COMPUTE WS-CHAR-NUM-ENCRYPTED = WS-CHAR-NUM-ENCRYPTED - 26
           END-IF
      *// WE DO NOT TREAT ANYTHING BUT CHARS
           IF WS-CHAR-NUM LESS THAN 65 OR GREATER THAN 91
             MOVE FUNCTION CHAR(WS-CHAR-NUM)
              TO WS-CIPHER(WS-IND:1)
           ELSE
             MOVE FUNCTION CHAR(WS-CHAR-NUM-ENCRYPTED)
              TO WS-CIPHER(WS-IND:1)
           END-IF
         END-PERFORM
         .