       IDENTIFICATION DIVISION.
       PROGRAM-ID. reverse-string.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STRING PIC X(64).
       01 WS-STRING-REVERSE PIC X(64) VALUE SPACES.
       01 WS-LENGTH PIC 99.
       01 WS-IND PIC 99.

       PROCEDURE DIVISION.
       REVERSE-STRING.
         MOVE FUNCTION LENGTH(WS-STRING) TO WS-LENGTH
         MOVE FUNCTION REVERSE(FUNCTION TRIM(WS-STRING))
           TO WS-STRING
         DISPLAY WS-STRING.
