       IDENTIFICATION DIVISION.
       PROGRAM-ID. collatz-conjecture.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMBER PIC S9(8).
       01 WS-REM PIC S9(8).
       01 WS-RESULT PIC S9(8).
       01 WS-STEPS PIC 9(4).
       01 WS-ERROR PIC X(35).

       PROCEDURE DIVISION.
       COLLATZ-CONJECTURE.
        MOVE 0 TO WS-STEPS
        IF WS-NUMBER LESS THAN OR EQUAL TO 0
         MOVE "Only positive integers are allowed" TO WS-ERROR
        ELSE
         PERFORM CALCULATE-NUMBER UNTIL WS-NUMBER EQUAL 1
         MOVE SPACES TO WS-ERROR
        END-IF

       DISPLAY WS-STEPS
       DISPLAY WS-ERROR.

       CALCULATE-NUMBER.
        DIVIDE WS-NUMBER BY 2 GIVING WS-RESULT REMAINDER WS-REM
        IF WS-REM NOT EQUAL 0
         MULTIPLY 3 BY WS-NUMBER
         ADD 1 TO WS-NUMBER
        ELSE
          MOVE WS-RESULT TO WS-NUMBER
        END-IF
       ADD 1 TO WS-STEPS
       .
