       IDENTIFICATION DIVISION.
       PROGRAM-ID. difference-of-squares.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DIFFERENCE-OF-SQUARES PIC 9(8).
       01 WS-SUM-OF-SQUARES PIC 9(8).
       01 WS-IND-SUM PIC 9(8).
       01 WS-TEMP-VALUE PIC 9(8).
       01 WS-SQUARE-OF-SUM PIC 9(8).
       01 WS-IND-SQUARE PIC 9(8).
       01 WS-NUMBER PIC 9(8).

       PROCEDURE DIVISION.
      *// YOU CAN ALSO USE COMPUTE STATEMENT
      *// YOU CAN USE >= OR GREATER THAN OR EQUAL TO
       SQUARE-OF-SUM.
         MOVE 0 TO WS-TEMP-VALUE
         PERFORM VARYING WS-IND-SQUARE FROM 1 BY 1
          UNTIL WS-IND-SQUARE GREATER THAN WS-NUMBER
           ADD WS-IND-SQUARE TO WS-TEMP-VALUE
         END-PERFORM
         MULTIPLY WS-TEMP-VALUE BY WS-TEMP-VALUE 
           GIVING WS-SQUARE-OF-SUM
       .
       SUM-OF-SQUARES.
         MOVE 0 TO WS-TEMP-VALUE
         MOVE 0 TO WS-SUM-OF-SQUARES
         PERFORM VARYING WS-IND-SUM FROM 1 BY 1
          UNTIL WS-IND-SUM > WS-NUMBER
           MULTIPLY WS-IND-SUM BY WS-IND-SUM GIVING WS-TEMP-VALUE
           ADD WS-TEMP-VALUE TO WS-SUM-OF-SQUARES
         END-PERFORM
       .
       DIFFERENCE-OF-SQUARES.
        SUBTRACT WS-SUM-OF-SQUARES FROM WS-SQUARE-OF-SUM
         GIVING WS-DIFFERENCE-OF-SQUARES
       .
