       IDENTIFICATION DIVISION.
       PROGRAM-ID. nucleotide-count.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY. FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DNA PIC X(128).
       01 WS-A PIC 9(4).
       01 WS-C PIC 9(4).
       01 WS-G PIC 9(4).
       01 WS-T PIC 9(4).
       01 WS-ERROR PIC X(36).
       01 WS-LENGTH PIC 9(3).
       01 WS-SUM-DNA PIC 9(3).

       PROCEDURE DIVISION.
       NUCLEOTIDE-COUNT.
         MOVE FUNCTION LENGTH(FUNCTION TRIM(WS-DNA))
           TO WS-LENGTH
         INSPECT WS-DNA TALLYING WS-A FOR ALL 'A'
         INSPECT WS-DNA TALLYING WS-C FOR ALL 'C'
         INSPECT WS-DNA TALLYING WS-G FOR ALL 'G'
         INSPECT WS-DNA TALLYING WS-T FOR ALL 'T'

         COMPUTE WS-SUM-DNA = WS-A + WS-C + WS-G + WS-T

         IF WS-SUM-DNA NOT EQUAL WS-LENGTH
          MOVE 'ERROR: Invalid nucleotide in strand' TO WS-ERROR
         END-IF
        .